# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
# tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
# brew 'awscli'
# brew 'autoconf'
brew 'git'
brew 'git-flow'
brew 'git-stree'
brew 'highlight'
brew 'httpie'
# brew 'hub'
# brew 'latex2html'
brew 'mackup'
brew 'nano'
brew 'node'
brew 'openssl'
brew 'pandoc'
brew 'tcpdump'
brew 'tree'
# brew 'trash'
brew 'wget'

# Development-PHP
brew 'php70', args: ['without-apache']
brew 'php70-intl'
brew 'php70-xdebug'
brew 'composer'
brew 'phpunit'

# Development-Ruby
brew 'ruby'
brew 'rbenv'

# Development-Python (includes pip, easy_install)
brew 'python'

# Development-Database
# brew 'mariadb'
brew 'mysql'
brew 'sqlite'

# Apps
# cask 'alfred'
# cask 'atom'
cask 'balsamiq-mockups'
cask 'calibre'
# cask 'dropbox'
cask 'evernote'
cask 'firefox'
# cask 'github-desktop'
cask 'gitkraken'
# cask 'goofy'
cask 'google-chrome'
cask 'google-drive'
cask 'intellij-idea'
cask 'iterm2'
# cask 'mactex'
cask 'movist'
# cask 'mysqlworkbench'
cask 'phpstorm'
# cask 'screenhero'
cask 'sequel-pro'
# cask 'skype'
cask 'slack'
cask 'sublime-text3'
# cask 'textual'
# cask 'tower'
# cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
# cask 'virtualbox-extension-pack'
# cask 'vlc'
cask 'wireshark'
# cask 'wkhtmltopdf'

# Quicklook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'

# Fonts
# cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
